---
kind: type
id: T:Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
source: html/bffdd5da-7a0a-2450-efa8-84a1deeebae3.htm
---
# Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException

The exception that is thrown when the specified file exists.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class FileArgumentAlreadyExistsException : ArgumentException
```